## STEP 1: 문제 정의 및 목표 설정

**목표:**
- 타이타닉호 승객데이터를 기반으로 생존에 영향을 미치는 요인을 분석합니다.

**주요 과제:**
- 기본 EDA (Exploratory Data Analysis)
- 데이터 전처리 (불필요한 데이터 삭제, 추가, 변경)
- 인사이트 발굴

## STEP 2: 모듈 import

In [ ]:
from IPython.display import Image
import numpy as np
import pandas as pd
import seaborn as sns

## STEP 3: 데이터셋 로드

In [ ]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**컬럼(columns) 설명**

- survivied: 생존여부 (1: 생존, 0: 사망)
- pclass: 좌석 등급 (1등급, 2등급, 3등급)
- sex: 성별
- age: 나이
- sibsp: 형제 + 배우자 수
- parch: 부모 + 자녀 수
- fare: 좌석 요금
- embarked: 탑승 항구 (S, C, Q)
- class: pclass와 동일
- who: 성별과 동일
- adult_male: 성인 남자 여부
- deck: 데크 번호 (알파벳 + 숫자 혼용)
- embark_town: 탑승 항구 이름
- alive: 생존여부 (yes, no)
- alone: 혼자 탑승 여부

## STEP 4: 기본 데이터 조회

### 상위 5개의 행을 출력

In [ ]:
# 코드를 입력해 주세요

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### 하위 5개의 행을 출력

In [ ]:
# 코드를 입력해 주세요

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

### 데이터는 몇개의 행과 열로 이루어져 있는지 확인

In [ ]:
# 코드를 입력해 주세요

(891, 15)

### 컬럼 별 데이터의 dtype과 개수를 확인

In [ ]:
# 코드를 입력해 주세요

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

### 데이터의 컬럼별 결측치를 확인

In [ ]:
# 코드를 입력해 주세요

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### 생존자와 사망자의 분포를 확인해 주세요

0: 사망, 1: 생존

In [ ]:
# 코드를 입력해 주세요

0    549
1    342
Name: survived, dtype: int64

## STEP 5: 탐색적 데이터 분석 (EDA)

### 항구별 생존자

#### 합계

In [ ]:
# 코드를 입력해 주세요

embarked
C     93
Q     30
S    217
Name: survived, dtype: int64

#### 생존율

In [ ]:
# 코드를 입력해 주세요

embarked
C    0.553571
Q    0.389610
S    0.336957
Name: survived, dtype: float64

#### 합계 & 생존율 동시 출력

In [ ]:
# 코드를 입력해 주세요

          sum      mean
embarked
C          93  0.553571
Q          30  0.389610
S         217  0.336957

### 성별 합계 & 생존율 동시 출력

In [ ]:
# 코드를 입력해 주세요

        sum      mean
sex
female  233  0.742038
male    109  0.188908

### 혼자인 사람과 혼자가 아닌 경우 합계 & 생존율 동시 출력

In [ ]:
# 코드를 입력해 주세요

       sum      mean
alone
False  179  0.505650
True   163  0.303538

### 등급(pclass)별 생존자 합계 & 생존율 동시 출력

In [ ]:
# 코드를 입력해 주세요

        sum      mean
pclass
1       136  0.629630
2        87  0.472826
3       119  0.242363

### 성별, 등급별 생존자 합계 & 생존율 동시 출력

In [ ]:
# 코드를 입력해 주세요

               sum      mean
sex    pclass
female 1        91  0.968085
       2        70  0.921053
       3        72  0.500000
male   1        45  0.368852
       2        17  0.157407
       3        47  0.135447

### pivot_table 을 활용하여, (성별, pclass) 별 생존자 합계(sum)를 출력 하세요

In [ ]:
# 코드를 입력해 주세요

       sum              mean
pclass   1   2   3         1         2         3
sex
female  91  70  72  0.968085  0.921053  0.500000
male    45  17  47  0.368852  0.157407  0.135447

### 혼자인 경우 / 성별 합계 & 생존율 동시 출력

In [ ]:
# 코드를 입력해 주세요

              sum      mean
alone sex
False female  134  0.712766
      male     45  0.271084
True  female   99  0.785714
      male     64  0.155718

### who, 등급별 생존자 합계 & 생존율 동시 출력

In [ ]:
# 코드를 입력해 주세요

              sum      mean
who   pclass
child 1         5  0.833333
      2        19  1.000000
      3        25  0.431034
man   1        42  0.352941
      2         8  0.080808
      3        38  0.119122
woman 1        89  0.978022
      2        60  0.909091
      3        56  0.491228

### 다음을 수행하세요

위의 결과를 토대로
1. 별도의 DataFrame로 생성 
2. 인덱스 초기화 `reset_index()` 
3. 생존율 내림차순 정렬

In [ ]:
# 코드를 입력해 주세요

     who  pclass  sum      mean
0  child       2   19  1.000000
1  woman       1   89  0.978022
2  woman       2   60  0.909091
3  child       1    5  0.833333
4  woman       3   56  0.491228
5  child       3   25  0.431034
6    man       1   42  0.352941
7    man       3   38  0.119122
8    man       2    8  0.080808

### child의 나이는 몇 세부터 몇 세까지 정의되었는지 확인

hint: `.loc`와 `agg`를 활용합니다.

In [ ]:
# 코드를 입력해 주세요
df.loc[df['who'] == 'child', 'age'].agg(['min', 'max'])

min     0.42
max    15.00
Name: age, dtype: float64

### 등급별(pclass) / 연령별(who) 평균 요금 비교

In [ ]:
# 코드를 입력해 주세요

                    fare
pclass who
1      child  139.382633
       man     65.951086
       woman  104.317995
2      child   28.323905
       man     19.054124
       woman   20.868624
3      child   23.220190
       man     11.340213
       woman   15.354351

### 부자는 살았을까? (fare 요금 기준 상위 10%의 생존율 확인)

fare 요금 기준 상위 10% 기준 요금 확인

In [ ]:
# 코드를 입력해 주세요

77.9583

부자의 데이터 개수와 생존율 확인

In [ ]:
# 코드를 입력해 주세요

count    90.000000
mean      0.766667
Name: survived, dtype: float64

### 생존자의 평균 나이와 사망자의 평균 나이 비교

In [ ]:
# 코드를 입력해 주세요

survived
0    30.626179
1    28.343690
Name: age, dtype: float64

### deck 정보가 NaN인 경우와 채워져 있는 경우 생존율 비교

deck 정보가 결측치인 경우 생존율

In [ ]:
# 코드를 입력해 주세요

0.29941860465116277

deck 정보가 결측치가 아닌 경우 생존율

In [ ]:
# 코드를 입력해 주세요

0.6699507389162561

## STEP 6: 전처리 (pre-processing)

### 결측치 처리

a) 결측치 확인

In [ ]:
# 코드를 입력해 주세요
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

b) `embarked` 컬럼은 **최빈값(mode)**으로 채워 주세요

In [ ]:
# 코드를 입력해 주세요

In [ ]:
# 코드 검증 (Cell 실행시 에러가 나지 않아야 함)
assert 0 == df['embarked'].isnull().sum()

c) `age` 컬럼의 결측치 처리
- 남자라면 => 남자 평균 나이로 채웁니다.
- 여자라면 => 여자 평균 나이로 채웁니다.

남성과 여성의 평균 나이를 출력

In [ ]:
# 코드를 입력해 주세요

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [ ]:
# 코드를 입력해 주세요

In [ ]:
# 코드 검증 (Cell 실행시 에러가 나지 않아야 함)
assert 27.92 == round(df.groupby('sex')['age'].mean()['female'], 2)
assert 30.73 == round(df.groupby('sex')['age'].mean()['male'], 2)

- embarked는 최빈값(most frequent)으로 일괄 채워주세요

d) `deck` 컬럼 결측치는 **No Data**로 채웁니다.

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

CategoricalDtype 임을 염두해 주세요

CategoricalDtype(categories=['A', 'B', 'C', 'D', 'E', 'F', 'G'], ordered=False)

`No Data`를 카테고리에 먼저 **추가**하기

In [ ]:
# 코드를 입력해 주세요

`No Data`로 결측치 채우기

In [ ]:
# 코드를 입력해 주세요

No Data    688
C           59
B           47
D           33
E           32
A           15
F           13
G            4
Name: deck, dtype: int64

### 중복된 컬럼 제거

제거 대상 컬럼
- `class`, `embark_town`, `alive`

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,No Data,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,No Data,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,No Data,Southampton,no,True

In [ ]:
# 코드를 입력해 주세요

In [ ]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,alone
0,0,3,male,22.0,1,0,7.2500,S,man,True,No Data,False
1,1,1,female,38.0,1,0,71.2833,C,woman,False,C,False
2,1,3,female,26.0,0,0,7.9250,S,woman,False,No Data,True
3,1,1,female,35.0,1,0,53.1000,S,woman,False,C,False
4,0,3,male,35.0,0,0,8.0500,S,man,True,No Data,True

### 특성 공학 (feature engineering)

a) 가족의 숫자는 `sibsp` + `parch` 숫자 입니다. `family` 컬럼을 만들고 **sibsp + parch 더한 값을 입력**해 주세요

In [ ]:
# 코드를 입력해 주세요

In [ ]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,alone,family
0,0,3,male,22.0,1,0,7.2500,S,man,True,No Data,False,1
1,1,1,female,38.0,1,0,71.2833,C,woman,False,C,False,1
2,1,3,female,26.0,0,0,7.9250,S,woman,False,No Data,True,0
3,1,1,female,35.0,1,0,53.1000,S,woman,False,C,False,1
4,0,3,male,35.0,0,0,8.0500,S,man,True,No Data,True,0

다음을 수행하세요

- 성별(sex), 가족수(family)별 생존율을 확인
- `reset_index()`후 생존율 내림차순 정렬

b) 성별 가족수 별 생존율 확인

In [ ]:
# 코드를 입력해 주세요

               survived
sex    family
female 0       0.785714
       1       0.816092
       2       0.775510
       3       0.842105
       4       0.250000
       5       0.375000
       6       0.375000
       7       0.000000
       10      0.000000
male   0       0.155718
       1       0.243243
       2       0.396226
       3       0.500000
       4       0.000000
       5       0.000000
       6       0.250000
       7       0.000000
       10      0.000000

c) 생존율 TOP 5 출력

In [ ]:
# 코드를 입력해 주세요

      sex  family  survived
0  female       3  0.842105
1  female       1  0.816092
2  female       0  0.785714
3  female       2  0.775510
4    male       3  0.500000

d) 생존율 하위 TOP 10 출력

In [ ]:
# 코드를 입력해 주세요

      sex  family  survived
0  female       4  0.250000
1    male       6  0.250000
2    male       1  0.243243
3    male       0  0.155718
4  female      10  0.000000
5    male       4  0.000000
6    male       5  0.000000
7  female       7  0.000000
8    male       7  0.000000
9    male      10  0.000000

e) apply 함수를 활용하여, 남자는 1, 여자는 0으로 값을 변경하고 `gender` 컬럼을 새로 만들어 적용하세요

In [ ]:
# 코드를 입력해 주세요
def make_bin(x):
    ????
    
df['gender'] = ???

In [ ]:
# 코드 검증

1    577
0    314
Name: gender, dtype: int64

f) 요금을 5구간으로 나누어 `fare_bin` 컬럼을 새로 만들어 적용하세요 (동일한 분포를 갖도록 `pd.qcut()`을 사용합니다)

In [ ]:
# 코드를 입력해 주세요

(7.854, 10.5]        184
(21.679, 39.688]     180
(-0.001, 7.854]      179
(39.688, 512.329]    176
(10.5, 21.679]       172
Name: fare_bin, dtype: int64

g) 나이를 10구간으로 나누어 `age_bin` 컬럼을 새로 만들어 적용하세요 (동일한 구간을 갖도록 `pd.cut()`을 사용합니다.)

In [ ]:
# 코드를 입력해 주세요

In [ ]:
df['age_bin'].value_counts()

(24.294, 32.252]    346
(16.336, 24.294]    177
(32.252, 40.21]     118
(40.21, 48.168]      70
(0.34, 8.378]        54
(8.378, 16.336]      46
(48.168, 56.126]     45
(56.126, 64.084]     24
(64.084, 72.042]      9
(72.042, 80.0]        2
Name: age_bin, dtype: int64